In [47]:
import pandas as pd

kolonner = [0, 1, 2, 3, 4]
kol_names = ['A','B','C','D', 'E']

df = pd.read_excel('TestSaltenLangso.xlsx', sheet_name='Individual Cost Statement',usecols=kolonner, names=kol_names, header=None)

C:\Users\soren\anaconda3\lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [67]:
from openpyxl.utils.dataframe import dataframe_to_rows

#sr = df['E'].squeeze()
#print(sr[37])

rk = 37
cl = 'E'

celle_dic = {
    'valuta': (37, 'E'),
    'partner': (5, 'B'),
    'periode_to': (3, 'E'),
    
}

print(f"Valuta: {df.loc[celle_dic['valuta']]} Partner: {df.loc[celle_dic['partner']]} Periode To: {df.loc[celle_dic['periode_to']]}")

Valuta: Dkr Partner: KÃ¸benhavns Universitet Periode To: 31. December 2020

In [82]:
df_cost = df.loc[10:22,['B']]
df_income = df.loc[10:13,['E']]
len(df_income)

4

In [69]:
for row_str in dataframe_to_rows(df_cost, index=False, header=False):
    #for i in row_str:
    print(row_str)

[1737465.2436388398]
[0]
[0]
[40854.23]
[0]
[0]
[0]
[0]
[0]
[0]
[267.2]
[124501]
[1903087.6736388397]

In [70]:
talrk = []
for i in df_cost['B']:
    talrk.append(round(i*(1/7.45)))

In [71]:
talrk

[233217, 0, 0, 5484, 0, 0, 0, 0, 0, 0, 36, 16712, 255448]

In [72]:
df_cost.insert(1, 'EURO', talrk)

In [73]:
df_cost

                 B    EURO
10  1737465.243639  233217
11               0       0
12               0       0
13        40854.23    5484
14               0       0
15               0       0
16               0       0
17               0       0
18               0       0
19               0       0
20           267.2      36
21          124501   16712
22  1903087.673639  255448

In [74]:
talrk = []
for i in df_cost['EURO']:
    talrk.append(round(i*(7.45)))

In [75]:
talrk

[1737467, 0, 0, 40856, 0, 0, 0, 0, 0, 0, 268, 124504, 1903088]

In [76]:
df_cost.insert(2, 'Dkr', talrk)

In [77]:
df_cost

                 B    EURO      Dkr
10  1737465.243639  233217  1737467
11               0       0        0
12               0       0        0
13        40854.23    5484    40856
14               0       0        0
15               0       0        0
16               0       0        0
17               0       0        0
18               0       0        0
19               0       0        0
20           267.2      36      268
21          124501   16712   124504
22  1903087.673639  255448  1903088

In [78]:
df_cost = df_cost.drop(columns=['B'])

In [80]:
for row_str in dataframe_to_rows(df_cost, index=False, header=True):
    #for i in row_str:
    print(row_str)
df_cost

['EURO', 'Dkr']
[233217, 1737467]
[0, 0]
[0, 0]
[5484, 40856]
[0, 0]
[0, 0]
[0, 0]
[0, 0]
[0, 0]
[0, 0]
[36, 268]
[16712, 124504]
[255448, 1903088]

      EURO      Dkr
10  233217  1737467
11       0        0
12       0        0
13    5484    40856
14       0        0
15       0        0
16       0        0
17       0        0
18       0        0
19       0        0
20      36      268
21   16712   124504
22  255448  1903088